app/controllers/api/channels_controller.rb

    def create
        @channel = Channel.new(channel_params)

        if @channel.save
---
INSERT INTO "channels" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "undefined undefined"], ["description", ""], ["user_id", 19], ["created_at", "2020-03-09 01:38:56.160476"], ["updated_at", "2020-03-09 01:38:56.160476"]]

    def show
        @channel = Channel.find_by(id: params[:id])
---
SELECT  "channels".* FROM "channels" WHERE "channels"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]