app/controllers/api/videos_controller.rb

SELECT "videos".* FROM "videos"
---
    def index
        # debugger
        @videos = Video.includes(:likes).all

SELECT  "videos".* FROM "videos" WHERE "videos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        @video = Video.find(params[:id])

INSERT INTO "videos" ("title", "description", "channel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "testtset"], ["description", "testset"], ["channel_id", 7], ["created_at", "2020-03-10 17:18:50.706433"], ["updated_at", "2020-03-10 17:18:50.706433"]]
---
    def create
        # set the video's channel to the current user's channel
        params[:video][:channel_id] = current_user.channel.id
        @video = Video.new(video_params);

        if @video.save